Public Attributes | List of all members
API_CalcAngleFormat Struct Reference
Project Settings
The API_CalcUnitPrefs structure contains this structure. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_AngleTypeID  | unit
The type of the angle measurement unit.
 short  | decimals
Number of decimals for angle measurement unit [0..4].
 short  | accuracy
European methods for rounding decimal values.
Detailed Description
The API_CalcUnitPrefs structure contains this structure.